Workspace/02-transonic-dlrbuffet-hisa-viscous/setups.orig/kEpsilonPhitF/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(k|omega|Ret|im|nuTilda|epsilon|phit|f)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-10;
        relTol          0;
        minIter         1;
    }

    "(k|omega|Ret|im|nuTilda|epsilon|phit|f)Final"
    {
        $nuTilda;
        tolerance       1e-10;
        reltol          0;
        minIter         1;
    }

    yPsi
    {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-5;
        relTol          0;
    }
}

relaxationFactors
{
    equations
    {
        nuTilda         0.5;
        k               0.5;
        omega           0.5;
	Ret             0.5;
	im   0.5;
    }
}

Jacobian LaxFriedrichs;

flowSolver
{
    solver            GMRES;
    GMRES
    {
        inviscidJacobian  LaxFriedrichs;
        viscousJacobian   laplacian;
        preconditioner    LUSGS;

        maxIter           20;
        nKrylov           8;
        solverTolRel      1e-1 (1e-1 1e-1 1e-1) 1e-1;
    }
}
pseudoTime
{
    nPseudoCorr        20;

    pseudoTol          1e-6 (1e-6 1e-6 1e-6) 1e-6;
    pseudoTolRel       1e-2 (1e-2 1e-2 1e-2) 1e-2;

    pseudoCoNum        1.0;
    pseudoCoNumMax     5.0;
    localTimestepping  true;
}






// ************************************************************************* //
